---
title: City
classe: Autodesk.Revit.DB.City
namespace: Autodesk.Revit.DB
eredita: Autodesk.Revit.DB.APIObject
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 5
---

# City

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Double Latitude { get; }` | `city.Latitude` | Double |
| `Double Longitude { get; }` | `city.Longitude` | Double |
| `String Name { get; }` | `city.Name` | String |
| `Double TimeZone { get; }` | `city.TimeZone` | Double |
| `String WeatherStation { get; }` | `city.WeatherStation` | String |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```